AI MOOC： **www.ai-xlab.com**

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([4,7,-5,3])#创建一个series，索引为默认值
print(s1)

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
s1.values#series的值

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
s1.index#series的索引

RangeIndex(start=0, stop=4, step=1)

In [5]:
s2 = pd.Series([4.0,6.5,-0.5,4.2],index=['d','b','a','c'])
print(s2)

d    4.0
b    6.5
a   -0.5
c    4.2
dtype: float64

In [6]:
s2['a']#根据索引取值

-0.5

In [7]:
s2[['a','b','c']]#根据索引取值

a   -0.5
b    6.5
c    4.2
dtype: float64

In [8]:
'b' in s2

True

In [9]:
'e' in s2

False

In [10]:
#Series可以看成是一个定长的有序字典
dic1 = {'apple':5,'pen':3,'applepen':10}
s3 = pd.Series(dic1)
print(s3)

apple        5
applepen    10
pen          3
dtype: int64

In [11]:
#DataFrame
data = {'year':[2014,2015,2016,2017],
        'income':[10000,30000,50000,80000],
        'pay':[5000,20000,30000,30000]
}
df1 = pd.DataFrame(data)
df1

   income    pay  year
0   10000   5000  2014
1   30000  20000  2015
2   50000  30000  2016
3   80000  30000  2017

In [12]:
df2 = pd.DataFrame(np.arange(12).reshape((3,4)))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [13]:
df3 = pd.DataFrame(np.arange(12).reshape((3,4)),index=['a','c','b'],columns=[2,33,44,5])
df3

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11

In [14]:
df1.columns #列

Index(['income', 'pay', 'year'], dtype='object')

In [17]:
df1.index #行

RangeIndex(start=0, stop=4, step=1)

In [18]:
df1.values

array([[10000,  5000,  2014],
       [30000, 20000,  2015],
       [50000, 30000,  2016],
       [80000, 30000,  2017]], dtype=int64)

In [19]:
df1.describe()

             income           pay         year
count      4.000000      4.000000     4.000000
mean   42500.000000  21250.000000  2015.500000
std    29860.788112  11814.539066     1.290994
min    10000.000000   5000.000000  2014.000000
25%    25000.000000  16250.000000  2014.750000
50%    40000.000000  25000.000000  2015.500000
75%    57500.000000  30000.000000  2016.250000
max    80000.000000  30000.000000  2017.000000

In [20]:
df1.T

            0      1      2      3
income  10000  30000  50000  80000
pay      5000  20000  30000  30000
year     2014   2015   2016   2017

In [21]:
df3

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11

In [22]:
df3.sort_index(axis=1)#列排序

   2   5   33  44
a   0   3   1   2
c   4   7   5   6
b   8  11   9  10

In [23]:
df3.sort_index(axis=0)#行排序

   2   33  44  5
a   0   1   2   3
b   8   9  10  11
c   4   5   6   7

In [26]:
df3.sort_values(by=44)

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11